h = int(input("กรอกชั่วโมง : "))          # กำหนด h เป็นจำนวนชั่วโมง
m = int(input("กรอกนาที : "))            # กำหนด m เป็นจำนวนนาที
s = int(input("กรอกวินาที : "))           # กำหนด s เป็นจำนวนวินาที

hts = h*3600          #\\\ แปลงค่าชั่วโมงเป็นวินาที โดยนำ ชั่วโมงมาคูณ 3600 // สามารถใช้  h = 60 /* 60 ได้
mts = m*60            #\\\ แปลงค่านาทีเป็นวินาที โดยนำ m มา คูณ 60 เพื่อแปลงเป็นจำนวนวินาที

total_second = hts + mts + s.strip() #นำเวลาทั้งหมดมารวมกัน 

print(f"จำนวนวินาทีทั้งหมดที่รวมได้ : {total_second} วินาที")  # Output แสดงค่าเวลาทั้งหมดที่รวมกัน



